In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import sklearn

# Data Loading

In [2]:
# from csv file
filepath = "./data/lr-Real-estate.csv"
df = pd.read_csv(filepath)
df.head()

,No,X1 transaction date,X2 house age,X3 distance to the nearest MRT station,X4 number of convenience stores,X5 latitude,X6 longitude,Y house price of unit area
0,1,2012.917,32.0,84.87882,10,24.98298,121.54024,37.9
1,2,2012.917,19.5,306.59470,9,24.98034,121.53951,42.2
2,3,2013.583,13.3,561.98450,5,24.98746,121.54391,47.3
3,4,2013.500,13.3,561.98450,5,24.98746,121.54391,54.8
4,5,2012.833,5.0,390.56840,5,24.97937,121.54245,43.1

In [3]:
df.columns

Index(['No', 'X1 transaction date', 'X2 house age',
       'X3 distance to the nearest MRT station',
       'X4 number of convenience stores', 'X5 latitude', 'X6 longitude',
       'Y house price of unit area'],
      dtype='object')

In [4]:
# drop irrelevant columns
df.drop(['No'], axis=1)
df.head(2)

,No,X1 transaction date,X2 house age,X3 distance to the nearest MRT station,X4 number of convenience stores,X5 latitude,X6 longitude,Y house price of unit area
0,1,2012.917,32.0,84.87882,10,24.98298,121.54024,37.9
1,2,2012.917,19.5,306.59470,9,24.98034,121.53951,42.2

In [8]:
# remove columns
df = df.rename(
    columns={
         'X1 transaction date':'date', 
         'X2 house age':'house age',
         'X3 distance to the nearest MRT station':'dist-nearest station',
         'X4 number of convenience stores':'num stores', 
         'X5 latitude':'lat', 
         'X6 longitude':'lon',
         'Y house price of unit area':'house price',
      
    }
)
df.head(2)

,No,date,house age,dist-nearest station,num stores,lat,lon,house price
0,1,2012.917,32.0,84.87882,10,24.98298,121.54024,37.9
1,2,2012.917,19.5,306.59470,9,24.98034,121.53951,42.2

In [10]:
df.shape # num of records, num of features

(414, 7)

In [9]:
df = df.drop(['date'], axis=1)

In [ ]:
df.isna().sum()

No                                        0
X1 transaction date                       0
X2 house age                              0
X3 distance to the nearest MRT station    0
X4 number of convenience stores           0
X5 latitude                               0
X6 longitude                              0
Y house price of unit area                0
dtype: int64